import random
import pandas as pd

def generate_user_info_and_reviews(num_users=50000, min_reviews_per_user=1, max_reviews_per_user=5):

    # 사용자 데이터를 담을 딕셔너리 초기화
    user_data = {
        '사용자ID': [],
        '연령대': [],
        '장애유무': [],
        '선호지역': [],
        '운동목표': [],
        '선호운동': [],
        '선호시간대': [],
        '선호빈도': [],
        '중요항목': []
    }

    # 사용자 각 항목에 대한 가중치 설정
    base_weight_dict = {
        '연령대': 0.2,
        '장애유무': 0.1,
        '선호지역': 0.15,
        '운동목표': 0.15,
        '선호운동': 0.1,
        '선호시간대': 0.1,
        '선호빈도': 0.1,
        '운동프로그램': 0.1,
    }

    # 리뷰 데이터를 담을 딕셔너리 초기화
    review_data = {
        '사용자ID': [],
        '리뷰ID': [],
        '운동프로그램': [],
        '가중평균만족도': []  # '가중평균만족도' 컬럼으로 변경
    }

    # 사용자 연령대, 장애 여부, 운동 목표 등의 랜덤 데이터 설정
    age_groups = ['학생', '성인', '노인']
    disabilities = ['유', '무']
    disabilities_weights = [0.05, 0.95]  # 유: 5%, 무: 95%
    area_dict = {
        '강남구': ['대치제1동', '대치제2동', '대치제4동', '도곡제1동', '도곡제2동', '개포제1동', '개포제2동', '개포제4동', '논현제1동', '논현제2동', '압구정동', '청담동', '삼성제1동', '삼성제2동', '역삼제1동', '역삼제2동', '일원본동', '일원제1동', '일원제2동', '수서동', '세곡동'],
        '강동구': ['강일동', '상일동', '고덕동', '명일동', '암사동', '천호동', '성내동', '길동', '둔촌동'],
        '강북구': ['삼양동', '미아동', '송중동', '송천동', '삼각산동', '번제1동', '번제2동', '번제3동', '수유제1동', '수유제2동', '수유제3동', '우이동', '인수동'],
        '강서구': ['염창동', '등촌제1동', '등촌제2동', '등촌제3동', '화곡본동', '화곡제1동', '화곡제2동', '화곡제3동', '화곡제4동', '화곡제6동', '화곡제8동', '우장산동', '가양제1동', '가양제2동', '가양제3동', '발산제1동', '공항동', '방화제1동', '방화제2동'],
        '관악구': ['은천동', '성현동', '청룡동', '보라매동', '청림동', '행운동', '낙성대동', '중앙동', '인헌동', '남현동', '서원동', '신원동', '서림동', '난곡동', '신사동', '신림동', '삼성동', '난향동', '조원동', '대학동', '미성동'],
        '광진구': ['중곡제1동', '중곡제2동', '중곡제3동', '중곡제4동', '능동', '구의제1동', '구의제2동', '구의제3동', '광장동', '자양제1동', '자양제2동', '자양제3동', '자양제4동', '화양동', '군자동'],
        '구로구': ['신도림동', '구로제1동', '구로제2동', '구로제3동', '구로제4동', '구로제5동', '가리봉동', '고척제1동', '고척제2동', '개봉제1동', '개봉제2동', '개봉제3동', '오류제1동', '오류제2동', '항동', '수궁동'],
        '금천구': ['가산동', '독산제1동', '독산제2동', '독산제3동', '독산제4동', '시흥제1동', '시흥제2동', '시흥제3동', '시흥제4동', '시흥제5동'],
        '노원구': ['월계제1동', '월계제2동', '월계제3동', '공릉제1.3동', '공릉제2동', '하계제1동', '하계제2동', '중계본동', '중계제1동', '중계제2.3동', '중계제4동', '상계제1동', '상계제2동', '상계제3.4동', '상계제5동', '상계제6.7동', '상계제8동', '상계제9동', '상계제10동'],
        '도봉구': ['쌍문제1동', '쌍문제2동', '쌍문제3동', '쌍문제4동', '방학제1동', '방학제2동', '방학제3동', '창제1동', '창제2동', '창제3동', '창제4동', '창제5동', '도봉제1동', '도봉제2동'],
        '동대문구': ['용신동', '제기동', '전농제1동', '전농제2동', '답십리제1동', '답십리제2동', '장안제1동', '장안제2동', '청량리동', '회기동', '휘경제1동', '휘경제2동', '이문제1동', '이문제2동'],
        '동작구': ['노량진제1동', '노량진제2동', '상도제1동', '상도제2동', '상도제3동', '상도제4동', '흑석동', '사당제1동', '사당제2동', '사당제3동', '사당제4동', '사당제5동', '대방동', '신대방제1동', '신대방제2동'],
        '마포구': ['아현동', '공덕동', '도화동', '용강동', '대흥동', '염리동', '신수동', '서강동', '서교동', '합정동', '망원제1동', '망원제2동', '연남동', '성산제1동', '성산제2동', '상암동'],
        '서대문구': ['충현동', '천연동', '북아현동', '신촌동', '연희동', '홍제제1동', '홍제제2동', '홍제제3동', '홍은제1동', '홍은제2동', '남가좌제1동', '남가좌제2동', '북가좌제1동', '북가좌제2동'],
        '서초구': ['서초제1동', '서초제2동', '서초제3동', '서초제4동', '잠원동', '반포본동', '반포제1동', '반포제2동', '반포제3동', '반포제4동', '방배본동', '방배제1동', '방배제2동', '방배제3동', '방배제4동', '양재제1동', '양재제2동', '내곡동'],
        '성동구': ['왕십리제2동', '왕십리도선동', '마장동', '사근동', '행당제1동', '행당제2동', '응봉동', '금호1가동', '금호2,3가동', '금호4가동', '옥수동', '성수1가제1동', '성수1가제2동', '성수2가제1동', '성수2가제3동', '송정동', '용답동'],
        '성북구': ['성북동', '삼선동', '동선동', '돈암제1동', '돈암제2동', '안암동', '보문동', '정릉제1동', '정릉제2동', '정릉제3동', '정릉제4동', '길음제1동', '길음제2동', '종암동', '월곡제1동', '월곡제2동', '장위제1동', '장위제2동', '장위제3동', '석관동'],
        '송파구': ['풍납제1동', '풍납제2동', '거여제1동', '거여제2동', '마천제1동', '마천제2동', '방이제1동', '방이제2동', '오륜동', '오금동', '송파제1동', '송파제2동', '석촌동', '삼전동', '가락본동', '가락제1동', '가락제2동', '문정제1동', '문정제2동', '잠실본동', '잠실제2동', '잠실제3동', '잠실제4동', '잠실제6동', '잠실제7동'],
        '양천구': ['목제1동', '목제2동', '목제3동', '목제4동', '목제5동', '신월제1동', '신월제2동', '신월제3동', '신월제4동', '신월제5동', '신월제6동', '신월제7동', '신정제1동', '신정제2동', '신정제3동', '신정제4동', '신정제6동', '신정제7동'],
        '영등포구': ['영등포본동', '영등포동', '여의동', '당산제1동', '당산제2동', '도림동', '문래동', '양평제1동', '양평제2동', '신길제1동', '신길제3동', '신길제4동', '신길제5동', '신길제6동', '신길제7동', '대림제1동', '대림제2동', '대림제3동'],
        '용산구': ['후암동', '용산2가동', '남영동', '청파동', '원효로제1동', '원효로제2동', '효창동', '용문동', '한강로동', '이촌제1동', '이촌제2동', '이태원제1동', '이태원제2동', '한남동', '서빙고동', '보광동'],
        '종로구': ['청운효자동', '사직동', '삼청동', '부암동', '평창동', '무악동', '교남동', '가회동', '종로1.2.3.4가동', '종로5.6가동', '이화동', '혜화동', '창신제1동', '창신제2동', '창신제3동', '숭인제1동', '숭인제2동'],
        '중구': ['소공동', '회현동', '명동', '필동', '장충동', '광희동', '을지로동', '신당동', '다산동', '약수동', '청구동', '신당5동', '동화동', '황학동', '중림동'],
        '은평구': ['녹번동', '응암1동', '응암2동', '응암3동', '불광1동', '불광2동', '신사동', '갈현동', '역촌동', '대조동', '구산동', '증산동', '수색동', '진관내동', '진관외동'],
        '중랑구': ['면목본동', '면목2동', '면목3동', '면목8동', '면목4동', '면목5동', '면목7동', '상봉1동', '상봉2동', '중화1동', '중화2동', '묵1동', '묵2동', '망우본동', '망우3동', '신내1동', '신내2동']
        }
    exercise_goals = ['수명 연장', '심폐 기능 향상', '근력 및 근육 강화', '유연성 향상', '체중 및 신체구성(체지방) 조절', '기분 개선', '무관']
    preferred_sports = ['구기및라켓', '레저', '무도', '무용', '민속', '재활', '체력단련및생활운동', '무관']
    preferred_time_slots = ['새벽', '오전', '오후', '저녁', '무관']
    exercise_programs = ['걷기', '단전호흡', '라틴살사', '리듬체조', '매일요가', '세라밴드', '실버스트레칭', '아쿠아로빅_관절염', '아쿠아로빅_임산부', '아쿠아로빅_소그룹', '아쿠아로빅_태보', '아쿠아워킹', '요가', '요가_산후', '요가_임산부', '요가_반야사', '요가_소그룹', '요가_하타', '우리춤체조', '웃음체조', '음악줄넘기', '재활', '재활_개인', '재활훈련', '체육교실', '치어리더', '학교체육']
    preferred_frequencies = ['주1회', '주2회', '주3회', '주4회이상', '무관']
    satisfaction_levels = [i * 0.1 for i in range(-1, 49)] 
    important_factors = ['연령대', '장애유무','선호지역', '운동목표', '선호운동', '선호시간대', '선호빈도', '운동프로그램']





    # 각 사용자에 대한 랜덤 데이터 생성
    for user_id in range(1, num_users + 1):
        # 사용자의 고정 데이터 생성
        age_group = random.choice(age_groups)
        disability = random.choices(disabilities, weights=disabilities_weights, k=1)[0]

        user_data['사용자ID'].append(user_id)
        user_data['연령대'].append(age_group)
        user_data['장애유무'].append(disability)

        # 사용자의 가변 데이터 생성
        goal = random.choice(exercise_goals)
        sport = random.choice(preferred_sports)
        time_slot = random.choice(preferred_time_slots)
        frequency = random.choice(preferred_frequencies)
        importance = random.choice(important_factors)

        # 선호지역에서 무작위로 지역 및 세부지역 선택
        selected_area = random.choice(list(area_dict.keys()))
        selected_sub_area = random.choice(area_dict[selected_area])

        user_data['선호지역'].append(f"{selected_area} {selected_sub_area}")
        user_data['운동목표'].append(goal)
        user_data['선호운동'].append(sport)
        user_data['선호시간대'].append(time_slot)
        user_data['선호빈도'].append(frequency)
        user_data['중요항목'].append(importance)     

        # 가중 평균 만족도 계산을 위한 변수 초기화
        total_weighted_satisfaction = 0


        # 운동 리뷰 생성
        num_reviews = random.randint(min_reviews_per_user, max_reviews_per_user)

        for review_id in range(1, num_reviews + 1):
            # 각 리뷰마다 랜덤한 중요항목, 운동프로그램, 랜덤 만족도 수준 선택
            importance = random.choice(important_factors)
            exercise_program = random.choice(exercise_programs)
            satisfaction = random.choice(satisfaction_levels)

            # 중요한 항목에 따른 가중치 추가
            weighted_satisfaction = satisfaction + base_weight_dict[importance]

            # 리뷰 데이터 딕셔너리에 추가
            review_data['사용자ID'].append(user_id)
            review_data['리뷰ID'].append(f"{user_id}_{review_id}")
            review_data['운동프로그램'].append(exercise_program)
            review_data['가중평균만족도'].append(weighted_satisfaction)



    # 사용자 정보와 운동 리뷰를 하나의 데이터프레임으로 병합
    user_info_df = pd.DataFrame(user_data)
    exercise_reviews_df = pd.DataFrame(review_data)
    combined_reviews_df = pd.merge(user_info_df, exercise_reviews_df, on='사용자ID')

    return combined_reviews_df

# 사용자 정보 및 운동 프로그램 리뷰 데이터 생성
exercise_reviews_dataset = generate_user_info_and_reviews(num_users=50000, min_reviews_per_user=1, max_reviews_per_user=5)

# 최종 데이터 출력
print("최종 데이터:")
print(exercise_reviews_dataset)

# CSV 파일로 저장
exercise_reviews_dataset.to_csv('C:/Users/User/project/SESAC/2023-Sesac-Project-BeLife/data/exercise_reviews_dataset.csv', index=False)

